{
  "name": "factory",
  "summary": "When a function returns an object, we call it a factory function.",
  "description": [
    "The factory pattern wraps a constructor for different types of objects and returns instances of the objects via a simple API. It makes it easy to create different objects by exposing a simple API that return the specified object type. [babs.craig]",
    "With a factory function, you can create as many user objects as you want. If you’re building a chat app, for instance, you can have a user object representing the current user, and also a lot of other user objects representing all the other users who are currently signed in and chatting. [eric.elliott]",
    "The Factory pattern can be especially useful when applied to the following situations: When our object or component setup involves a high level of complexity. When we need to easily generate different instances of objects depending on the environment we are in. When we’re working with many small objects or components that share the same properties. When composing objects with instances of other objects that need only satisfy an API contract (a.k.a., duck typing) to work. This is useful for decoupling. [addy.osmani]",
    "The factory function pattern is **similar to constructors**, but instead of using new to create an object, factory functions simply set up and return the new object when you call the function. [the.odin.project]"
  ],
  "category": "creational",
  "problem": [
    "There are many people who argue against using constructors at all. Their arguments boil down to the fact that if you aren’t careful, it can be easy to introduce bugs into your code when using constructors. [the.odin.project]",
    "In class-based programming, the factory method pattern is a creational pattern that uses factory methods **to deal with the problem of creating objects** without having to specify the exact class of the object that will be created. This is done by creating objects by calling a factory method—either specified in an interface and implemented by child classes, or implemented in a base class and optionally overridden by derived classes—rather than by calling a constructor. [jar.gon]"
  ],
  "example": ["function", "class"],
  "refs": {
    "javascript": {
      "babs.craig": "https://medium.com/@thebabscraig/javascript-design-patterns-part-1-the-factory-pattern-5f135e881192",
      "eric.elliott": "https://medium.com/javascript-scene/javascript-factory-functions-with-es6-4d224591a8b1",
      "addy.osmani": "https://addyosmani.com/resources/essentialjsdesignpatterns/book/",
      "the.odin.project": "https://www.theodinproject.com/paths/full-stack-javascript/courses/javascript/lessons/factory-functions-and-the-module-pattern",
      "jar.gon": "http://jargon.js.org/_glossary/FACTORY_PATTERN.md"
    },
    "misc": {}
  }
}
